﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿/=#
#include "VFR.uni"

#string STR_EGRMOD_PROMPT               #language eng "Engineering Mode"
#string STR_EGRMOD_HELP                 #language eng "Show/Hide Advance options"

#string STR_AAEON_MAIN      #language eng "Main"
#string STR_AAEON_ADVANCED  #language eng "Advanced"
#string STR_AAEON_CHIPSET   #language eng "Chipset"
#string STR_AAEON_SECURITY  #language eng "Security"
#string STR_AAEON_BOOT      #language eng "Boot"
#string STR_AAEON_EXIT      #language eng "Save & Exit"

#string STR_MAIN            #language eng "CRB Main"
#string STR_ADVANCED        #language eng "CRB Advanced"
#string STR_CHIPSET         #language eng "CRB Chipset"
#string STR_SECURITY        #language eng "CRB Security"
#string STR_BOOT            #language eng "CRB Boot"
#string STR_EXIT            #language eng "CRB Save & Exit"

#string STR_CRB_SETUP_PROMPT       #language eng "CRB Setup"
#string STR_CRB_SETUP_HELP         #language eng "Enter CRB Setup for testing ONLY!"

#string STR_COMMON_ENABLED          #language eng "Enabled"
#string STR_COMMON_DISABLED         #language eng "Disabled"

#string STR_AAEON_FEATURES_FORM			#language eng "AAEON Features"
#string STR_AAEON_WAKE_EVENTS			#language eng "Wake Events"

//---------------------------------------------------------------------------
// SATA Configuration
//---------------------------------------------------------------------------
#string STR_SATA_CONFIG_FORM               #language eng "SATA Configuration"
#string STR_SATA_CONFIG_FORM_HELP          #language eng "SATA Devices Configuration"
//---------------------------------------------------------------------------
// Power Management Setup String
//---------------------------------------------------------------------------
#string STR_POWER_MANAGEMENT			#language eng "Power Management"
#string STR_POWER_MANAGEMENT_HELP		#language eng "System ACPI/ Power Mode/ Wake Event Configurations"
#string STR_WAKE_CONFIGURATION			#language eng "Wake Configuration"
#string STR_AAEONRIWAKEENABLE			#language eng "RI Wake Event"
#string STR_AAEONRIWAKEENABLE_HELP		#language eng "System wake up from RI# Enabled/Disabled"

//---------------------------------------------------------------------------
// Hardware Monitor Setup String
//---------------------------------------------------------------------------
#string STR_AAEON_HARDWARE_MONITOR_CONFIG_FORM	#language eng "Hardware Monitor"
#string STR_AAEON_HARDWARE_MONITOR_CONFIG_FORM_HELP	#language eng ""

//---------------------------------------------------------------------------
// Boot Configuration
//---------------------------------------------------------------------------
#string STR_PXE_OPROM_POLICY			#language eng "Launch PXE ROM"


#string AAEON_STR_PRI_DISPLAY_PROMPT		#language eng "Primary Boot Display"
#string AAEON_STR_SEC_DISPLAY_PROMPT		#language eng "Secondary Boot Display"

#string STR_SIO_CONFIGURATION 		#language eng "SIO Configuration"
#string STR_SIO_CONFIGURATION_HELP 	#language eng "SIO Chip configuration. Enable or Disable SIO Logical Devices, Resources and Features settings, etc."